Function res=G(xx,x,f,M)
% исходные данные Ц x, f; ћ Ц значени€ вторых производных
n=size(x);
n=n(2);
h=zeros(1,n-1);
% вычисление шага
for i=1:n-1
    h(i)=x(i+1) - x(i);
end
for j=1:length(xx)
X=xx(j);
% определение номера интервала
for i=1:n-1
if x(i)<=X && X<x(i+1)
k=i;
break
end
end
% вычисление значени€ сплайна в промежуточной точке
yy(j)=M(k)*((x(k+1)-X)^3)/(6*h(k)) + M(k+1)*((X-x(k))^3)/(6*h(k)) +...
(f(k)-M(k)*(h(k)^2)/6)*(x(k+1)-X)/h(k)+...
(f(k+1)-M(k+1)*(h(k)^2)/6)*(X-x(k))/h(k);
end;
res=yy;
return
% вызов процедур и построение графика
% >> x = [-4 -3.5 -2 0 2.1 2.5 5];
% >> f=[0.5 0.2 -0.7 0 1.1 0.8 -1.6];
% >> xx=linspace(-4,5,1000)
% >> M = Work(x,f) % функци€ нахождени€ вторых производных
% >> yy=G(xx,x,f,M);
% >> plot(xx,yy,'r')